{
  "11-19-2024": {
    "bugs": [
        {
            "title": "Fixed invalid upgrade in Gnome Software",
            "description": "Gnome Software would display an upgrade to gnome-control-center-data but fail to install it."
        },
        {
            "title": "Fixed outdated upgrade indicator",
            "description": "The indicator that shows up when installing upgrades needed to be upgraded to Gnome 47."
        },
        {
            "title": "Fixed ssh security issue",
            "description": "SSH host keys were stored in the image, which slightly increased the likelyhood of MITM attacks on ssh connections.",
            "affected": "Users who manually enabled and logged onto their Vanilla OS device through ssh"
        }
    ],
    "enhancements": [
        {
            "title": "Removed grub-mkconfig",
            "description": "This utility would break the boot if ran incorrectly."
        }
    ]
},
  "11-12-2024": {
    "bugs": [],
    "enhancements": [
        {
            "title": "Upgraded packages",
            "description": "We synced the package repository with Debian sid. This includes an upgrade to Gnome 47."
        },
        {
            "title": "Added \"Open Terminal Here\" Option to Gnome Files",
            "description": "You can now open a terminal window with a right click in the Files app in the folder you're currently working in."
        },
        {
            "title": "Added rescue shell for the terminal",
            "description": "If your terminal somehow breaks you can now easily recover by opening a \"rescue shell\" by right clicking Black Box in the overview."
        },
        {
            "title": "Yellow accent color",
            "description": "We decided to make the default Gnome Accent color on Vanilla OS yellow to match our general theme. You can change this color from the settings."
        },
        {
            "title": "ABRoot now supports more registries",
            "description": "You can now use images from other container registries and are not limited to Github Container Registry."
        },
        {
            "title": "New and improved translations",
            "description": "Some of the supported languages have been updated."
        }
    ]
},
  "10-30-2025": {
    "bugs": [
        {
            "title": "Waydroid Residual Files",
            "description": "Removed leftover files from the old Waydroid module."
        },
        {
            "title": "Minor Translation Fixes",
            "description": "Fixed small translation issues across the system."
        }
    ],
    "enhancements": [
        {
            "title": "Updated Debian Repositories",
            "description": "Synced with the latest Debian repositories and applied all recent security patches."
        },
        {
            "title": "Initramfs Theme Integration",
            "description": "Added Vanilla theme to initramfs font generation to ensure proper font inclusion during build."
        },
        {
            "title": "libfuse2 Compatibility",
            "description": "Added libfuse2 for backward compatibility with AppImages not yet migrated to libfuse3."
        },
        {
            "title": "Distrobox by Default",
            "description": "Installed Distrobox by default for advanced use cases beyond Apx."
        },
        {
            "title": "Updated Software and Drivers",
            "description": "All Vanilla OS software and drivers updated to their latest versions."
        },
        {
            "title": "Updated Translations",
            "description": "Refreshed and improved translations across the system."
        }
    ]
},
  "09-25-2024": {
    "bugs": [
        {
            "title": "Fixed a critical bug that prevents the boot in the 1.0.3 image",
            "description": "Due to changes introduced with the last Debian repo sync, GDM were not able to write on its own path, preventing the device to complete the boot.",
            "affected": "New and existing users",
            "link": "https://github.com/Vanilla-OS/desktop-image/releases/tag/v1.0.4"
        }
    ],
    "enhancements": [
        {
            "title": "New Image Release with boot fixes",
            "description": "We have shipped a new release across our images with a fix for a critical bug preventing the boot from happening.",
            "version": "1.0.4",
            "link": "https://github.com/Vanilla-OS/desktop-image/releases/tag/v1.0.4"
        }
    ]
},
  "09-21-2024": {
    "bugs": [
    ],
    "enhancements": [
        {
            "title": "New Image Release with updated packages and bug fixes",
            "description": "We have shipped a new release across our images bringing updated packages and bug fixes to your Vanilla OS Installation. You will receive the update automatically via VSO in the forthcoming days (based on the your update settings). It can also be performed manually with abroot upgrade command (for updating the host alone) or with vso sys upgrade command (to update both the host and VSO shell environment).",
            "version": "1.0.2",
            "link": "https://github.com/Vanilla-OS/desktop-image/releases/tag/v1.0.2"
        }
    ]
},
  "08-26-2024": {
    "bugs": [
        {
            "title": "Fixed installer crashing while looking for Wi-Fi connections",
            "description": "Some users have reported that the installer crashes randomly, after a thorough analysis, one of the issues was related to the continuous scanning of Wi-Fi networks. We have disabled this scanning and the user will have to provide the connection from the system settings.",
            "affected": "Users installing",
            "link": "https://github.com/Vanilla-OS/vanilla-installer/pull/425"
        }
    ],
    "enhancements": [
    ]
},
  "08-05-2024": {
    "bugs": [
        {
            "title": "Fixed missing wayland session and GDM freezes for most NVIDIA users",
            "description": "Some NVIDIA users reported the GNOME Wayland session was not available and some other reported GDM freezes, making the login impossible. This change rollbacks to NVIDIA 535 and introduced a new vanilla-exp image for those who needs more updated drivers (beta drivers). Everything documented in our handbook.",
            "affected": "NVIDIA users",
            "link": "https://github.com/Vanilla-OS/nvidia-image/pull/49"
        }
    ],
    "enhancements": [
        {
            "title": "Deprecated the nvidia-proprietary image",
            "description": "We have deprecated the nvidia-proprietary image and replaced by nvidia and nvidia-exp images. Once upgraded, Vanilla OS will ask the user to switch image by pointing to the documentation."
        },
        {
            "title": "Removed multi image support for NVIDIA devices in installer",
            "description": "The installer now always proposes to install the nvidia image for all NVIDIA devices, since the nvidia-proprietary image got deprecated. Users who really need for recent drivers (at costs of possible issues) can opt for the Custom Image option during the installation and type ghcr.io/vanilla-os/nvidia-exp once asked."
        },
        {
            "title": "New and improved translations",
            "description": "One or more of the supported languages have been updated."
        }
    ]
},
  "08-01-2024": {
    "bugs": [
        {
            "title": "Newly created users were not able to complete the First Setup Wizard",
            "affected": "Newly created users",
            "version": "2.2.1",
            "fixed": "2.2.3",
            "link": "https://github.com/Vanilla-OS/first-setup/releases/tag/v2.2.3"
        },
        {
            "title": "Some NVIDIA setups were unable to boot",
            "affected": "NVIDIA users on some specific setups"
        }
    ],
    "enhancements": [
        {
            "title": "Support for custom images in the Installer",
            "description": "Users can now use their own system images during the installation process. Usefull for OEMs and users who need specific firmware or drivers.",
            "version": "2.3.7",
            "link": "https://github.com/Vanilla-OS/vanilla-installer/releases/tag/v2.3.7"
        },
        {
            "title": "Support for new NVIDIA images in the installer",
            "description": "We have 2 different images for NVIDIA now, one for recent GPUs using the official Open NVIDIA drivers, one for old GPUs using the official proprietary NVIDIA drivers; the installer will automatically detect the hardware and pick the correct one."
        },
        {
            "title": "New and improved translations",
            "description": "One or more of the supported languages have been updated."
        }
    ]
},
  "06-12-2025": {
    "bugs": [
        {
            "title": "Fixes APX Gui",
            "description": "A missing package prevented the app from starting."
        },
        {
            "title": "Fixes GDM boot issue",
            "description": "GDM would fail on some systems causing the boot to freeze."
        }
    ],
    "enhancements": [
    ]
},
  "06-05-2025": {
    "bugs": [
        {
            "title": "Fixed Files app issue with external drives",
            "description": "This problem caused nautilus to show up external drives only for a few milliseconds."
        },
        {
            "title": "Automatically repairs broken LVM roots",
            "description": "Some systems have a slightly corrupted boot drive due to a broken LVM version. These systems will be automatically repaired when booting into the new version. (the partition for user data is completely fine and not affected by this)"
        },
        {
            "title": "Removed broken File app share feature including samba",
            "description": "We removed the nautilus-share feature, since it was completely unusable anyway and samba caused quite a few problems and is a possible vulnerability. This does not affect mounting network drives with smb. If your workflow requires a samba server, you can add it with the 'abroot pkg' utility."
        },
        {
            "title": "Removed broken waydroid implementation",
            "description": "This feature never worked correctly on Vanilla OS so we decided to remove it for the time being."
        },
        {
            "title": "Prevents users from running invalid commands in apx",
            "description": "Some apx commands could create incorrect behavior of the tool itself. This includes commands as removing a stack before removing the subsystem first or creating a subsystem with the same name as an apx command. These will now be blocked automatically."
        }
    ],
    "enhancements": [
        {
            "title": "Gnome 48",
            "description": "This release includes the new version of the desktop environment Gnome. It has many new features like HDR support or a completely new Wellbeing page in the settings."
        },
        {
            "title": "Completely revamped First Setup",
            "description": "First Setup was rebuilt from the ground up for a much improved experience and accessibility."
        },
        {
            "title": "Added abroot flag for freeing up space",
            "description": "Especially when using custom images, it can happen that you run out of space in your roots. A flag for some abroot operations was added to free up space on the future partition to recover from situations like these."
        },
        {
            "title": "Enhanced abroot permissions",
            "description": "Regular users can now run abroot upgrades, rollback, status and the help page without an admin password."
        },
        {
            "title": "Upgraded distrobox version for apx",
            "description": "We upgraded to a newer distrobox version with many bug fixes and enhancements."
        },
        {
            "title": "New and improved translations",
            "description": "Many translations have been added across the program."
        },
        {
            "title": "Upgraded packages",
            "description": "We synced the package repository with Debian sid for security and bug fixes."
        }
    ]
},
  "02-26-2025": {
    "bugs": [
    ],
    "enhancements": [
        {
            "title": "Added support for silent mode in VSO",
            "description": "We have added support for silent mode in our latest VSO release."
        },
        {
            "title": "Fixed HP Printer Regression",
            "description": "The HP printer package (hplib) regression has been fixed upstream and it has been added back to our images."
        },
        {
            "title": "Updated Distrobox base package",
            "description": "We have updated our tools to the latest Distrobox version."
        },
        {
            "title": "Updated GNOME Bluetooth package",
            "description": "We have updated the GNOME bluetooth file sharing package, which has been renamed upstream."
        },
        {
            "title": "Upgraded packages",
            "description": "We synced the package repository with Debian sid for security and bug fixes."
        }
    ]
},
  "02-19-2025": {
    "bugs": [
        {
            "title": "Fixed upgrade issue",
            "description": "Updates could break due to a partition running out of space."
        }
    ],
    "enhancements": [
        {
            "title": "Upgraded ABRoot",
            "description": "ABRoot now supports installing to /opt inside the image and keeps the state of /media and /mnt so that mountpoints stay consistant."
        }
    ]
},
  "01-21-2025": {
    "bugs": [
        {
            "title": "HP Printer Regression",
            "description": "The HP printer package (hplib) is currently broken and had to be removed for this release. It will be readded as soon as possible."
        },
        {
            "title": "Fixes system partitions in nautilus",
            "description": "We removed system partitions for nautilus to prevent confusion."
        },
        {
            "title": "Fixed path issue",
            "description": "Some applications couldn't find exported binaries."
        }
    ],
    "enhancements": [
        {
            "title": "Bluetooth printers and files",
            "description": "We added support for bluetooth printers and bluetooth file sharing."
        },
        {
            "title": "Upgraded packages",
            "description": "We synced the package repository with Debian sid for security and bug fixes."
        }
    ]
}
}
